<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"ce7e2cd51136fcbeb5d1220dc3a1f408dd1b68b5518ee531aa02245fbe3207e8","plan_job_ref":"Job Terraform plan #34 at https://github.com/mkuthan/stream-processing/actions/runs/7531857382","plan_out_hash":"e8e840cf225757c352bbb86f6d94c214a37e9bb2ba81430753045dd6008e9693","plan_hash":"b775f5e0f6e839b4be22a00c6c48fb557df20a5133c034bee6f8e854a7cda6e0","plan_text_format":"diff","version":"1.41.0"} -->
Terraform plan in __toll-infrastructure__
<details>
<summary>Plan: 3 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # google_pubsub_subscription.toll-booth-entry-subscription will be created
+   resource "google_pubsub_subscription" "toll-booth-entry-subscription" {
+       ack_deadline_seconds       = (known after apply)
+       effective_labels           = (known after apply)
+       id                         = (known after apply)
+       message_retention_duration = "604800s"
+       name                       = "toll-booth-entry"
+       project                    = "playground-272019"
+       terraform_labels           = (known after apply)
+       topic                      = "projects/playground-272019/topics/toll-booth-entry"
    }

  # google_pubsub_subscription.toll-booth-exit-subscription will be created
+   resource "google_pubsub_subscription" "toll-booth-exit-subscription" {
+       ack_deadline_seconds       = (known after apply)
+       effective_labels           = (known after apply)
+       id                         = (known after apply)
+       message_retention_duration = "604800s"
+       name                       = "toll-booth-exit"
+       project                    = "playground-272019"
+       terraform_labels           = (known after apply)
+       topic                      = "projects/playground-272019/topics/toll-booth-exit"
    }

  # google_pubsub_subscription.vehicle-registration-subscription will be created
+   resource "google_pubsub_subscription" "vehicle-registration-subscription" {
+       ack_deadline_seconds       = (known after apply)
+       effective_labels           = (known after apply)
+       id                         = (known after apply)
+       message_retention_duration = "604800s"
+       name                       = "vehicle-registration"
+       project                    = "playground-272019"
+       terraform_labels           = (known after apply)
+       topic                      = "projects/playground-272019/topics/vehicle-registration"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform plan #34](https://github.com/mkuthan/stream-processing/actions/runs/7531857382)